TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.0.LTS *
       3                    ;* Date/Time created: Sat Apr 17 13:50:07 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.0.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\pschaumont\git_ecedhawebinar\ecedhawebinar\msp432_l
      13 00000000                   .bss    y$1,4,4
      14                    
      15                    $C$DW$1 .dwtag  DW_TAG_subprogram

    2174                            .dwattr $C$DW$T$323, DW_AT_decl_column(0x03)
    2175                    
    2176                    
    2177                    $C$DW$T$324     .dwtag  DW_TAG_enumeration_type
    2178                            .dwattr $C$DW$T$324, DW_AT_byte_size(0x01)
    2179                    $C$DW$112       .dwtag  DW_TAG_enumerator
    2180                            .dwattr $C$DW$112, DW_AT_name("ARM_MATH_SUCCESS")
    2181                            .dwattr $C$DW$112, DW_AT_const_value(0x00)
    2182                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2183                            .dwattr $C$DW$112, DW_AT_decl_line(0x185)
    2184                            .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    2185                    
    2186                    $C$DW$113       .dwtag  DW_TAG_enumerator
    2187                            .dwattr $C$DW$113, DW_AT_name("ARM_MATH_ARGUMENT_ERROR")
    2188                            .dwattr $C$DW$113, DW_AT_const_value(-1)
    2189                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2190                            .dwattr $C$DW$113, DW_AT_decl_line(0x186)
    2191                            .dwattr $C$DW$113, DW_AT_decl_column(0x05)
    2192                    
    2193                    $C$DW$114       .dwtag  DW_TAG_enumerator
    2194                            .dwattr $C$DW$114, DW_AT_name("ARM_MATH_LENGTH_ERROR")
    2195                            .dwattr $C$DW$114, DW_AT_const_value(-2)
    2196                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2197                            .dwattr $C$DW$114, DW_AT_decl_line(0x187)
    2198                            .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    2199                    
    2200                    $C$DW$115       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   41

    2201                            .dwattr $C$DW$115, DW_AT_name("ARM_MATH_SIZE_MISMATCH")
    2202                            .dwattr $C$DW$115, DW_AT_const_value(-3)
    2203                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2204                            .dwattr $C$DW$115, DW_AT_decl_line(0x188)
    2205                            .dwattr $C$DW$115, DW_AT_decl_column(0x05)
    2206                    
    2207                    $C$DW$116       .dwtag  DW_TAG_enumerator
    2208                            .dwattr $C$DW$116, DW_AT_name("ARM_MATH_NANINF")
    2209                            .dwattr $C$DW$116, DW_AT_const_value(-4)
    2210                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2211                            .dwattr $C$DW$116, DW_AT_decl_line(0x189)
    2212                            .dwattr $C$DW$116, DW_AT_decl_column(0x05)
    2213                    
    2214                    $C$DW$117       .dwtag  DW_TAG_enumerator
    2215                            .dwattr $C$DW$117, DW_AT_name("ARM_MATH_SINGULAR")
    2216                            .dwattr $C$DW$117, DW_AT_const_value(-5)
    2217                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2218                            .dwattr $C$DW$117, DW_AT_decl_line(0x18a)
    2219                            .dwattr $C$DW$117, DW_AT_decl_column(0x05)
    2220                    
    2221                    $C$DW$118       .dwtag  DW_TAG_enumerator
    2222                            .dwattr $C$DW$118, DW_AT_name("ARM_MATH_TEST_FAILURE")
    2223                            .dwattr $C$DW$118, DW_AT_const_value(-6)
    2224                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2225                            .dwattr $C$DW$118, DW_AT_decl_line(0x18b)
    2226                            .dwattr $C$DW$118, DW_AT_decl_column(0x05)
    2227                    
    2228                            .dwattr $C$DW$T$324, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    2229                            .dwattr $C$DW$T$324, DW_AT_decl_line(0x184)
    2230                            .dwattr $C$DW$T$324, DW_AT_decl_column(0x03)
    2231                            .dwendtag $C$DW$T$324
    2232                    
    2233                    $C$DW$T$325     .dwtag  DW_TAG_typedef
    2234                            .dwattr $C$DW$T$325, DW_AT_name("arm_status")
    2235                            .dwattr $C$DW$T$325, DW_AT_type(*$C$DW$T$324)
    2236                            .dwattr $C$DW$T$325, DW_AT_language(DW_LANG_C)
    2237                            .dwattr $C$DW$T$325, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    2238                            .dwattr $C$DW$T$325, DW_AT_decl_line(0x18c)
    2239                            .dwattr $C$DW$T$325, DW_AT_decl_column(0x05)
    2240                    
    2241                    
    2242                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2243                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    2244                    $C$DW$119       .dwtag  DW_TAG_member
    2245                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$14)
    2246                            .dwattr $C$DW$119, DW_AT_name("__max_align1")
    2247                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("__max_align1")
    2248                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2249                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2250                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccs1000/ccs/tools/compiler/ti-cgt-arm_20.2.0.LTS/inc
    2251                            .dwattr $C$DW$119, DW_AT_decl_line(0x7b)
    2252                            .dwattr $C$DW$119, DW_AT_decl_column(0x0c)
    2253                    
    2254                    $C$DW$120       .dwtag  DW_TAG_member
    2255                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$18)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   42

    2256                            .dwattr $C$DW$120, DW_AT_name("__max_align2")
    2257                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("__max_align2")
    2258                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2259                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2260                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccs1000/ccs/tools/compiler/ti-cgt-arm_20.2.0.LTS/inc
    2261                            .dwattr $C$DW$120, DW_AT_decl_line(0x7c)
    2262                            .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    2263                    
    2264                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1000/ccs/tools/compiler/ti-cgt-arm_20.2.0.LTS/in
    2265                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
    2266                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2267                            .dwendtag $C$DW$T$21
    2268                    
    2269                    $C$DW$T$326     .dwtag  DW_TAG_typedef
    2270                            .dwattr $C$DW$T$326, DW_AT_name("__max_align_t")
    2271                            .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$21)
    2272                            .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
    2273                            .dwattr $C$DW$T$326, DW_AT_decl_file("C:/ti/ccs1000/ccs/tools/compiler/ti-cgt-arm_20.2.0.LTS/i
    2274                            .dwattr $C$DW$T$326, DW_AT_decl_line(0x7d)
    2275                            .dwattr $C$DW$T$326, DW_AT_decl_column(0x03)
    2276                    
    2277                    
    2278                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2279                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    2280                    $C$DW$121       .dwtag  DW_TAG_member
    2281                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$23)
    2282                            .dwattr $C$DW$121, DW_AT_name("_reserved0")
    2283                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("_reserved0")
    2284                            .dwattr $C$DW$121, DW_AT_bit_offset(0x10)
    2285                            .dwattr $C$DW$121, DW_AT_bit_size(0x10)
    2286                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2288                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2289                            .dwattr $C$DW$121, DW_AT_decl_line(0x107)
    2290                            .dwattr $C$DW$121, DW_AT_decl_column(0x0e)
    2291                    
    2292                    $C$DW$122       .dwtag  DW_TAG_member
    2293                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$23)
    2294                            .dwattr $C$DW$122, DW_AT_name("GE")
    2295                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("GE")
    2296                            .dwattr $C$DW$122, DW_AT_bit_offset(0x0c)
    2297                            .dwattr $C$DW$122, DW_AT_bit_size(0x04)
    2298                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2299                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2300                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2301                            .dwattr $C$DW$122, DW_AT_decl_line(0x108)
    2302                            .dwattr $C$DW$122, DW_AT_decl_column(0x0e)
    2303                    
    2304                    $C$DW$123       .dwtag  DW_TAG_member
    2305                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$23)
    2306                            .dwattr $C$DW$123, DW_AT_name("_reserved1")
    2307                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("_reserved1")
    2308                            .dwattr $C$DW$123, DW_AT_bit_offset(0x05)
    2309                            .dwattr $C$DW$123, DW_AT_bit_size(0x07)
    2310                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   43

    2311                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2312                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2313                            .dwattr $C$DW$123, DW_AT_decl_line(0x109)
    2314                            .dwattr $C$DW$123, DW_AT_decl_column(0x0e)
    2315                    
    2316                    $C$DW$124       .dwtag  DW_TAG_member
    2317                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$23)
    2318                            .dwattr $C$DW$124, DW_AT_name("Q")
    2319                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("Q")
    2320                            .dwattr $C$DW$124, DW_AT_bit_offset(0x04)
    2321                            .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    2322                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2324                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2325                            .dwattr $C$DW$124, DW_AT_decl_line(0x10a)
    2326                            .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    2327                    
    2328                    $C$DW$125       .dwtag  DW_TAG_member
    2329                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$23)
    2330                            .dwattr $C$DW$125, DW_AT_name("V")
    2331                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("V")
    2332                            .dwattr $C$DW$125, DW_AT_bit_offset(0x03)
    2333                            .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    2334                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2335                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2336                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2337                            .dwattr $C$DW$125, DW_AT_decl_line(0x10b)
    2338                            .dwattr $C$DW$125, DW_AT_decl_column(0x0e)
    2339                    
    2340                    $C$DW$126       .dwtag  DW_TAG_member
    2341                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$23)
    2342                            .dwattr $C$DW$126, DW_AT_name("C")
    2343                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("C")
    2344                            .dwattr $C$DW$126, DW_AT_bit_offset(0x02)
    2345                            .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    2346                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2347                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2348                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2349                            .dwattr $C$DW$126, DW_AT_decl_line(0x10c)
    2350                            .dwattr $C$DW$126, DW_AT_decl_column(0x0e)
    2351                    
    2352                    $C$DW$127       .dwtag  DW_TAG_member
    2353                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$23)
    2354                            .dwattr $C$DW$127, DW_AT_name("Z")
    2355                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("Z")
    2356                            .dwattr $C$DW$127, DW_AT_bit_offset(0x01)
    2357                            .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2358                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2359                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2360                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2361                            .dwattr $C$DW$127, DW_AT_decl_line(0x10d)
    2362                            .dwattr $C$DW$127, DW_AT_decl_column(0x0e)
    2363                    
    2364                    $C$DW$128       .dwtag  DW_TAG_member
    2365                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$23)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   44

    2366                            .dwattr $C$DW$128, DW_AT_name("N")
    2367                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("N")
    2368                            .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    2369                            .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2370                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2372                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2373                            .dwattr $C$DW$128, DW_AT_decl_line(0x10e)
    2374                            .dwattr $C$DW$128, DW_AT_decl_column(0x0e)
    2375                    
    2376                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_par
    2377                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x106)
    2378                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
    2379                            .dwendtag $C$DW$T$24
    2380                    
    2381                    
    2382                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2383                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    2384                    $C$DW$129       .dwtag  DW_TAG_member
    2385                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$23)
    2386                            .dwattr $C$DW$129, DW_AT_name("ISR")
    2387                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("ISR")
    2388                            .dwattr $C$DW$129, DW_AT_bit_offset(0x17)
    2389                            .dwattr $C$DW$129, DW_AT_bit_size(0x09)
    2390                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2391                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2392                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2393                            .dwattr $C$DW$129, DW_AT_decl_line(0x12e)
    2394                            .dwattr $C$DW$129, DW_AT_decl_column(0x0e)
    2395                    
    2396                    $C$DW$130       .dwtag  DW_TAG_member
    2397                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$23)
    2398                            .dwattr $C$DW$130, DW_AT_name("_reserved0")
    2399                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("_reserved0")
    2400                            .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2401                            .dwattr $C$DW$130, DW_AT_bit_size(0x17)
    2402                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2403                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2404                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2405                            .dwattr $C$DW$130, DW_AT_decl_line(0x12f)
    2406                            .dwattr $C$DW$130, DW_AT_decl_column(0x0e)
    2407                    
    2408                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_par
    2409                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x12d)
    2410                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    2411                            .dwendtag $C$DW$T$25
    2412                    
    2413                    
    2414                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2415                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    2416                    $C$DW$131       .dwtag  DW_TAG_member
    2417                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$23)
    2418                            .dwattr $C$DW$131, DW_AT_name("ISR")
    2419                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("ISR")
    2420                            .dwattr $C$DW$131, DW_AT_bit_offset(0x17)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   45

    2421                            .dwattr $C$DW$131, DW_AT_bit_size(0x09)
    2422                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2423                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2424                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2425                            .dwattr $C$DW$131, DW_AT_decl_line(0x140)
    2426                            .dwattr $C$DW$131, DW_AT_decl_column(0x0e)
    2427                    
    2428                    $C$DW$132       .dwtag  DW_TAG_member
    2429                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$23)
    2430                            .dwattr $C$DW$132, DW_AT_name("_reserved0")
    2431                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("_reserved0")
    2432                            .dwattr $C$DW$132, DW_AT_bit_offset(0x16)
    2433                            .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2434                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2435                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2436                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2437                            .dwattr $C$DW$132, DW_AT_decl_line(0x141)
    2438                            .dwattr $C$DW$132, DW_AT_decl_column(0x0e)
    2439                    
    2440                    $C$DW$133       .dwtag  DW_TAG_member
    2441                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$23)
    2442                            .dwattr $C$DW$133, DW_AT_name("ICI_IT_1")
    2443                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ICI_IT_1")
    2444                            .dwattr $C$DW$133, DW_AT_bit_offset(0x10)
    2445                            .dwattr $C$DW$133, DW_AT_bit_size(0x06)
    2446                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2448                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2449                            .dwattr $C$DW$133, DW_AT_decl_line(0x142)
    2450                            .dwattr $C$DW$133, DW_AT_decl_column(0x0e)
    2451                    
    2452                    $C$DW$134       .dwtag  DW_TAG_member
    2453                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$23)
    2454                            .dwattr $C$DW$134, DW_AT_name("GE")
    2455                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("GE")
    2456                            .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    2457                            .dwattr $C$DW$134, DW_AT_bit_size(0x04)
    2458                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2459                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2460                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2461                            .dwattr $C$DW$134, DW_AT_decl_line(0x143)
    2462                            .dwattr $C$DW$134, DW_AT_decl_column(0x0e)
    2463                    
    2464                    $C$DW$135       .dwtag  DW_TAG_member
    2465                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$23)
    2466                            .dwattr $C$DW$135, DW_AT_name("_reserved1")
    2467                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("_reserved1")
    2468                            .dwattr $C$DW$135, DW_AT_bit_offset(0x08)
    2469                            .dwattr $C$DW$135, DW_AT_bit_size(0x04)
    2470                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2471                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2472                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2473                            .dwattr $C$DW$135, DW_AT_decl_line(0x144)
    2474                            .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    2475                    
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   46

    2476                    $C$DW$136       .dwtag  DW_TAG_member
    2477                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$23)
    2478                            .dwattr $C$DW$136, DW_AT_name("T")
    2479                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("T")
    2480                            .dwattr $C$DW$136, DW_AT_bit_offset(0x07)
    2481                            .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2482                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2483                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2484                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2485                            .dwattr $C$DW$136, DW_AT_decl_line(0x145)
    2486                            .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2487                    
    2488                    $C$DW$137       .dwtag  DW_TAG_member
    2489                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
    2490                            .dwattr $C$DW$137, DW_AT_name("ICI_IT_2")
    2491                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("ICI_IT_2")
    2492                            .dwattr $C$DW$137, DW_AT_bit_offset(0x05)
    2493                            .dwattr $C$DW$137, DW_AT_bit_size(0x02)
    2494                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2495                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2496                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2497                            .dwattr $C$DW$137, DW_AT_decl_line(0x146)
    2498                            .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2499                    
    2500                    $C$DW$138       .dwtag  DW_TAG_member
    2501                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
    2502                            .dwattr $C$DW$138, DW_AT_name("Q")
    2503                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("Q")
    2504                            .dwattr $C$DW$138, DW_AT_bit_offset(0x04)
    2505                            .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2506                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2507                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2508                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2509                            .dwattr $C$DW$138, DW_AT_decl_line(0x147)
    2510                            .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2511                    
    2512                    $C$DW$139       .dwtag  DW_TAG_member
    2513                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
    2514                            .dwattr $C$DW$139, DW_AT_name("V")
    2515                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("V")
    2516                            .dwattr $C$DW$139, DW_AT_bit_offset(0x03)
    2517                            .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2518                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2519                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2520                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2521                            .dwattr $C$DW$139, DW_AT_decl_line(0x148)
    2522                            .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2523                    
    2524                    $C$DW$140       .dwtag  DW_TAG_member
    2525                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$23)
    2526                            .dwattr $C$DW$140, DW_AT_name("C")
    2527                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("C")
    2528                            .dwattr $C$DW$140, DW_AT_bit_offset(0x02)
    2529                            .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2530                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   47

    2531                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2532                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2533                            .dwattr $C$DW$140, DW_AT_decl_line(0x149)
    2534                            .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    2535                    
    2536                    $C$DW$141       .dwtag  DW_TAG_member
    2537                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$23)
    2538                            .dwattr $C$DW$141, DW_AT_name("Z")
    2539                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("Z")
    2540                            .dwattr $C$DW$141, DW_AT_bit_offset(0x01)
    2541                            .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2542                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2543                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2544                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2545                            .dwattr $C$DW$141, DW_AT_decl_line(0x14a)
    2546                            .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2547                    
    2548                    $C$DW$142       .dwtag  DW_TAG_member
    2549                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$23)
    2550                            .dwattr $C$DW$142, DW_AT_name("N")
    2551                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("N")
    2552                            .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    2553                            .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2554                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2555                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2556                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2557                            .dwattr $C$DW$142, DW_AT_decl_line(0x14b)
    2558                            .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2559                    
    2560                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_par
    2561                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x13f)
    2562                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
    2563                            .dwendtag $C$DW$T$26
    2564                    
    2565                    
    2566                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2567                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2568                    $C$DW$143       .dwtag  DW_TAG_member
    2569                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$23)
    2570                            .dwattr $C$DW$143, DW_AT_name("nPRIV")
    2571                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("nPRIV")
    2572                            .dwattr $C$DW$143, DW_AT_bit_offset(0x1f)
    2573                            .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2574                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2576                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2577                            .dwattr $C$DW$143, DW_AT_decl_line(0x177)
    2578                            .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2579                    
    2580                    $C$DW$144       .dwtag  DW_TAG_member
    2581                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$23)
    2582                            .dwattr $C$DW$144, DW_AT_name("SPSEL")
    2583                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("SPSEL")
    2584                            .dwattr $C$DW$144, DW_AT_bit_offset(0x1e)
    2585                            .dwattr $C$DW$144, DW_AT_bit_size(0x01)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   48

    2586                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2587                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2588                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2589                            .dwattr $C$DW$144, DW_AT_decl_line(0x178)
    2590                            .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    2591                    
    2592                    $C$DW$145       .dwtag  DW_TAG_member
    2593                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$23)
    2594                            .dwattr $C$DW$145, DW_AT_name("FPCA")
    2595                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("FPCA")
    2596                            .dwattr $C$DW$145, DW_AT_bit_offset(0x1d)
    2597                            .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2598                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2600                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2601                            .dwattr $C$DW$145, DW_AT_decl_line(0x179)
    2602                            .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2603                    
    2604                    $C$DW$146       .dwtag  DW_TAG_member
    2605                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$23)
    2606                            .dwattr $C$DW$146, DW_AT_name("_reserved0")
    2607                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("_reserved0")
    2608                            .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2609                            .dwattr $C$DW$146, DW_AT_bit_size(0x1d)
    2610                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2611                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2612                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2613                            .dwattr $C$DW$146, DW_AT_decl_line(0x17a)
    2614                            .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2615                    
    2616                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_par
    2617                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x176)
    2618                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    2619                            .dwendtag $C$DW$T$27
    2620                    
    2621                    
    2622                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2623                            .dwattr $C$DW$T$37, DW_AT_byte_size(0xe04)
    2624                    $C$DW$147       .dwtag  DW_TAG_member
    2625                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$29)
    2626                            .dwattr $C$DW$147, DW_AT_name("ISER")
    2627                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("ISER")
    2628                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2630                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2631                            .dwattr $C$DW$147, DW_AT_decl_line(0x198)
    2632                            .dwattr $C$DW$147, DW_AT_decl_column(0x12)
    2633                    
    2634                    $C$DW$148       .dwtag  DW_TAG_member
    2635                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$30)
    2636                            .dwattr $C$DW$148, DW_AT_name("RESERVED0")
    2637                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("RESERVED0")
    2638                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2639                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2640                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   49

    2641                            .dwattr $C$DW$148, DW_AT_decl_line(0x199)
    2642                            .dwattr $C$DW$148, DW_AT_decl_column(0x12)
    2643                    
    2644                    $C$DW$149       .dwtag  DW_TAG_member
    2645                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$29)
    2646                            .dwattr $C$DW$149, DW_AT_name("ICER")
    2647                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("ICER")
    2648                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2649                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2650                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2651                            .dwattr $C$DW$149, DW_AT_decl_line(0x19a)
    2652                            .dwattr $C$DW$149, DW_AT_decl_column(0x12)
    2653                    
    2654                    $C$DW$150       .dwtag  DW_TAG_member
    2655                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$30)
    2656                            .dwattr $C$DW$150, DW_AT_name("RESERVED1")
    2657                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("RESERVED1")
    2658                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2659                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2660                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2661                            .dwattr $C$DW$150, DW_AT_decl_line(0x19b)
    2662                            .dwattr $C$DW$150, DW_AT_decl_column(0x12)
    2663                    
    2664                    $C$DW$151       .dwtag  DW_TAG_member
    2665                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$29)
    2666                            .dwattr $C$DW$151, DW_AT_name("ISPR")
    2667                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("ISPR")
    2668                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2669                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2670                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2671                            .dwattr $C$DW$151, DW_AT_decl_line(0x19c)
    2672                            .dwattr $C$DW$151, DW_AT_decl_column(0x12)
    2673                    
    2674                    $C$DW$152       .dwtag  DW_TAG_member
    2675                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$30)
    2676                            .dwattr $C$DW$152, DW_AT_name("RESERVED2")
    2677                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("RESERVED2")
    2678                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2679                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2680                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2681                            .dwattr $C$DW$152, DW_AT_decl_line(0x19d)
    2682                            .dwattr $C$DW$152, DW_AT_decl_column(0x12)
    2683                    
    2684                    $C$DW$153       .dwtag  DW_TAG_member
    2685                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$29)
    2686                            .dwattr $C$DW$153, DW_AT_name("ICPR")
    2687                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("ICPR")
    2688                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    2689                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2690                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2691                            .dwattr $C$DW$153, DW_AT_decl_line(0x19e)
    2692                            .dwattr $C$DW$153, DW_AT_decl_column(0x12)
    2693                    
    2694                    $C$DW$154       .dwtag  DW_TAG_member
    2695                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$30)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   50

    2696                            .dwattr $C$DW$154, DW_AT_name("RESERVED3")
    2697                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("RESERVED3")
    2698                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    2699                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2700                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2701                            .dwattr $C$DW$154, DW_AT_decl_line(0x19f)
    2702                            .dwattr $C$DW$154, DW_AT_decl_column(0x12)
    2703                    
    2704                    $C$DW$155       .dwtag  DW_TAG_member
    2705                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$29)
    2706                            .dwattr $C$DW$155, DW_AT_name("IABR")
    2707                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("IABR")
    2708                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    2709                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2710                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2711                            .dwattr $C$DW$155, DW_AT_decl_line(0x1a0)
    2712                            .dwattr $C$DW$155, DW_AT_decl_column(0x12)
    2713                    
    2714                    $C$DW$156       .dwtag  DW_TAG_member
    2715                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
    2716                            .dwattr $C$DW$156, DW_AT_name("RESERVED4")
    2717                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("RESERVED4")
    2718                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    2719                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2720                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2721                            .dwattr $C$DW$156, DW_AT_decl_line(0x1a1)
    2722                            .dwattr $C$DW$156, DW_AT_decl_column(0x12)
    2723                    
    2724                    $C$DW$157       .dwtag  DW_TAG_member
    2725                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$35)
    2726                            .dwattr $C$DW$157, DW_AT_name("IP")
    2727                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("IP")
    2728                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    2729                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2730                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2731                            .dwattr $C$DW$157, DW_AT_decl_line(0x1a2)
    2732                            .dwattr $C$DW$157, DW_AT_decl_column(0x12)
    2733                    
    2734                    $C$DW$158       .dwtag  DW_TAG_member
    2735                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$36)
    2736                            .dwattr $C$DW$158, DW_AT_name("RESERVED5")
    2737                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("RESERVED5")
    2738                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    2739                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2740                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2741                            .dwattr $C$DW$158, DW_AT_decl_line(0x1a3)
    2742                            .dwattr $C$DW$158, DW_AT_decl_column(0x12)
    2743                    
    2744                    $C$DW$159       .dwtag  DW_TAG_member
    2745                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$28)
    2746                            .dwattr $C$DW$159, DW_AT_name("STIR")
    2747                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("STIR")
    2748                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    2749                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2750                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   51

    2751                            .dwattr $C$DW$159, DW_AT_decl_line(0x1a4)
    2752                            .dwattr $C$DW$159, DW_AT_decl_column(0x12)
    2753                    
    2754                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_par
    2755                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x197)
    2756                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    2757                            .dwendtag $C$DW$T$37
    2758                    
    2759                    $C$DW$T$327     .dwtag  DW_TAG_typedef
    2760                            .dwattr $C$DW$T$327, DW_AT_name("NVIC_Type")
    2761                            .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$37)
    2762                            .dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
    2763                            .dwattr $C$DW$T$327, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    2764                            .dwattr $C$DW$T$327, DW_AT_decl_line(0x1a5)
    2765                            .dwattr $C$DW$T$327, DW_AT_decl_column(0x04)
    2766                    
    2767                    
    2768                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2769                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x8c)
    2770                    $C$DW$160       .dwtag  DW_TAG_member
    2771                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$38)
    2772                            .dwattr $C$DW$160, DW_AT_name("CPUID")
    2773                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("CPUID")
    2774                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2776                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2777                            .dwattr $C$DW$160, DW_AT_decl_line(0x1ba)
    2778                            .dwattr $C$DW$160, DW_AT_decl_column(0x12)
    2779                    
    2780                    $C$DW$161       .dwtag  DW_TAG_member
    2781                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$28)
    2782                            .dwattr $C$DW$161, DW_AT_name("ICSR")
    2783                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("ICSR")
    2784                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2785                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2786                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2787                            .dwattr $C$DW$161, DW_AT_decl_line(0x1bb)
    2788                            .dwattr $C$DW$161, DW_AT_decl_column(0x12)
    2789                    
    2790                    $C$DW$162       .dwtag  DW_TAG_member
    2791                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$28)
    2792                            .dwattr $C$DW$162, DW_AT_name("VTOR")
    2793                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("VTOR")
    2794                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2795                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2796                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2797                            .dwattr $C$DW$162, DW_AT_decl_line(0x1bc)
    2798                            .dwattr $C$DW$162, DW_AT_decl_column(0x12)
    2799                    
    2800                    $C$DW$163       .dwtag  DW_TAG_member
    2801                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$28)
    2802                            .dwattr $C$DW$163, DW_AT_name("AIRCR")
    2803                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("AIRCR")
    2804                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2805                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   52

    2806                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2807                            .dwattr $C$DW$163, DW_AT_decl_line(0x1bd)
    2808                            .dwattr $C$DW$163, DW_AT_decl_column(0x12)
    2809                    
    2810                    $C$DW$164       .dwtag  DW_TAG_member
    2811                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$28)
    2812                            .dwattr $C$DW$164, DW_AT_name("SCR")
    2813                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("SCR")
    2814                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2815                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2816                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2817                            .dwattr $C$DW$164, DW_AT_decl_line(0x1be)
    2818                            .dwattr $C$DW$164, DW_AT_decl_column(0x12)
    2819                    
    2820                    $C$DW$165       .dwtag  DW_TAG_member
    2821                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$28)
    2822                            .dwattr $C$DW$165, DW_AT_name("CCR")
    2823                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("CCR")
    2824                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2825                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2826                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2827                            .dwattr $C$DW$165, DW_AT_decl_line(0x1bf)
    2828                            .dwattr $C$DW$165, DW_AT_decl_column(0x12)
    2829                    
    2830                    $C$DW$166       .dwtag  DW_TAG_member
    2831                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$39)
    2832                            .dwattr $C$DW$166, DW_AT_name("SHP")
    2833                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("SHP")
    2834                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2835                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2836                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2837                            .dwattr $C$DW$166, DW_AT_decl_line(0x1c0)
    2838                            .dwattr $C$DW$166, DW_AT_decl_column(0x12)
    2839                    
    2840                    $C$DW$167       .dwtag  DW_TAG_member
    2841                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$28)
    2842                            .dwattr $C$DW$167, DW_AT_name("SHCSR")
    2843                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("SHCSR")
    2844                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2845                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2846                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2847                            .dwattr $C$DW$167, DW_AT_decl_line(0x1c1)
    2848                            .dwattr $C$DW$167, DW_AT_decl_column(0x12)
    2849                    
    2850                    $C$DW$168       .dwtag  DW_TAG_member
    2851                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$28)
    2852                            .dwattr $C$DW$168, DW_AT_name("CFSR")
    2853                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("CFSR")
    2854                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2855                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2856                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2857                            .dwattr $C$DW$168, DW_AT_decl_line(0x1c2)
    2858                            .dwattr $C$DW$168, DW_AT_decl_column(0x12)
    2859                    
    2860                    $C$DW$169       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   53

    2861                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$28)
    2862                            .dwattr $C$DW$169, DW_AT_name("HFSR")
    2863                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("HFSR")
    2864                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2865                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2866                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2867                            .dwattr $C$DW$169, DW_AT_decl_line(0x1c3)
    2868                            .dwattr $C$DW$169, DW_AT_decl_column(0x12)
    2869                    
    2870                    $C$DW$170       .dwtag  DW_TAG_member
    2871                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$28)
    2872                            .dwattr $C$DW$170, DW_AT_name("DFSR")
    2873                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("DFSR")
    2874                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2875                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2876                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2877                            .dwattr $C$DW$170, DW_AT_decl_line(0x1c4)
    2878                            .dwattr $C$DW$170, DW_AT_decl_column(0x12)
    2879                    
    2880                    $C$DW$171       .dwtag  DW_TAG_member
    2881                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$28)
    2882                            .dwattr $C$DW$171, DW_AT_name("MMFAR")
    2883                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("MMFAR")
    2884                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2885                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2886                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2887                            .dwattr $C$DW$171, DW_AT_decl_line(0x1c5)
    2888                            .dwattr $C$DW$171, DW_AT_decl_column(0x12)
    2889                    
    2890                    $C$DW$172       .dwtag  DW_TAG_member
    2891                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$28)
    2892                            .dwattr $C$DW$172, DW_AT_name("BFAR")
    2893                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("BFAR")
    2894                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2895                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2896                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2897                            .dwattr $C$DW$172, DW_AT_decl_line(0x1c6)
    2898                            .dwattr $C$DW$172, DW_AT_decl_column(0x12)
    2899                    
    2900                    $C$DW$173       .dwtag  DW_TAG_member
    2901                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$28)
    2902                            .dwattr $C$DW$173, DW_AT_name("AFSR")
    2903                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("AFSR")
    2904                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2905                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2906                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2907                            .dwattr $C$DW$173, DW_AT_decl_line(0x1c7)
    2908                            .dwattr $C$DW$173, DW_AT_decl_column(0x12)
    2909                    
    2910                    $C$DW$174       .dwtag  DW_TAG_member
    2911                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$40)
    2912                            .dwattr $C$DW$174, DW_AT_name("PFR")
    2913                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("PFR")
    2914                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2915                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   54

    2916                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2917                            .dwattr $C$DW$174, DW_AT_decl_line(0x1c8)
    2918                            .dwattr $C$DW$174, DW_AT_decl_column(0x12)
    2919                    
    2920                    $C$DW$175       .dwtag  DW_TAG_member
    2921                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$38)
    2922                            .dwattr $C$DW$175, DW_AT_name("DFR")
    2923                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("DFR")
    2924                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2925                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2926                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2927                            .dwattr $C$DW$175, DW_AT_decl_line(0x1c9)
    2928                            .dwattr $C$DW$175, DW_AT_decl_column(0x12)
    2929                    
    2930                    $C$DW$176       .dwtag  DW_TAG_member
    2931                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$38)
    2932                            .dwattr $C$DW$176, DW_AT_name("ADR")
    2933                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("ADR")
    2934                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2935                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2936                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2937                            .dwattr $C$DW$176, DW_AT_decl_line(0x1ca)
    2938                            .dwattr $C$DW$176, DW_AT_decl_column(0x12)
    2939                    
    2940                    $C$DW$177       .dwtag  DW_TAG_member
    2941                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$41)
    2942                            .dwattr $C$DW$177, DW_AT_name("MMFR")
    2943                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("MMFR")
    2944                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2945                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2946                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2947                            .dwattr $C$DW$177, DW_AT_decl_line(0x1cb)
    2948                            .dwattr $C$DW$177, DW_AT_decl_column(0x12)
    2949                    
    2950                    $C$DW$178       .dwtag  DW_TAG_member
    2951                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$42)
    2952                            .dwattr $C$DW$178, DW_AT_name("ISAR")
    2953                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("ISAR")
    2954                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2955                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2956                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2957                            .dwattr $C$DW$178, DW_AT_decl_line(0x1cc)
    2958                            .dwattr $C$DW$178, DW_AT_decl_column(0x12)
    2959                    
    2960                    $C$DW$179       .dwtag  DW_TAG_member
    2961                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$43)
    2962                            .dwattr $C$DW$179, DW_AT_name("RESERVED0")
    2963                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("RESERVED0")
    2964                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2965                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2966                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2967                            .dwattr $C$DW$179, DW_AT_decl_line(0x1cd)
    2968                            .dwattr $C$DW$179, DW_AT_decl_column(0x12)
    2969                    
    2970                    $C$DW$180       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   55

    2971                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$28)
    2972                            .dwattr $C$DW$180, DW_AT_name("CPACR")
    2973                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("CPACR")
    2974                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2975                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2976                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2977                            .dwattr $C$DW$180, DW_AT_decl_line(0x1ce)
    2978                            .dwattr $C$DW$180, DW_AT_decl_column(0x12)
    2979                    
    2980                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_par
    2981                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x1b9)
    2982                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2983                            .dwendtag $C$DW$T$44
    2984                    
    2985                    $C$DW$T$328     .dwtag  DW_TAG_typedef
    2986                            .dwattr $C$DW$T$328, DW_AT_name("SCB_Type")
    2987                            .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$44)
    2988                            .dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
    2989                            .dwattr $C$DW$T$328, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    2990                            .dwattr $C$DW$T$328, DW_AT_decl_line(0x1cf)
    2991                            .dwattr $C$DW$T$328, DW_AT_decl_column(0x03)
    2992                    
    2993                    
    2994                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2995                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
    2996                    $C$DW$181       .dwtag  DW_TAG_member
    2997                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$45)
    2998                            .dwattr $C$DW$181, DW_AT_name("RESERVED0")
    2999                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("RESERVED0")
    3000                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3001                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3002                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3003                            .dwattr $C$DW$181, DW_AT_decl_line(0x2d1)
    3004                            .dwattr $C$DW$181, DW_AT_decl_column(0x12)
    3005                    
    3006                    $C$DW$182       .dwtag  DW_TAG_member
    3007                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$38)
    3008                            .dwattr $C$DW$182, DW_AT_name("ICTR")
    3009                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ICTR")
    3010                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3011                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3012                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3013                            .dwattr $C$DW$182, DW_AT_decl_line(0x2d2)
    3014                            .dwattr $C$DW$182, DW_AT_decl_column(0x12)
    3015                    
    3016                    $C$DW$183       .dwtag  DW_TAG_member
    3017                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$28)
    3018                            .dwattr $C$DW$183, DW_AT_name("ACTLR")
    3019                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ACTLR")
    3020                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3021                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3022                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3023                            .dwattr $C$DW$183, DW_AT_decl_line(0x2d3)
    3024                            .dwattr $C$DW$183, DW_AT_decl_column(0x12)
    3025                    
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   56

    3026                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_par
    3027                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2d0)
    3028                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    3029                            .dwendtag $C$DW$T$46
    3030                    
    3031                    $C$DW$T$329     .dwtag  DW_TAG_typedef
    3032                            .dwattr $C$DW$T$329, DW_AT_name("SCnSCB_Type")
    3033                            .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$46)
    3034                            .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
    3035                            .dwattr $C$DW$T$329, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    3036                            .dwattr $C$DW$T$329, DW_AT_decl_line(0x2d4)
    3037                            .dwattr $C$DW$T$329, DW_AT_decl_column(0x03)
    3038                    
    3039                    
    3040                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3041                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    3042                    $C$DW$184       .dwtag  DW_TAG_member
    3043                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$28)
    3044                            .dwattr $C$DW$184, DW_AT_name("CTRL")
    3045                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("CTRL")
    3046                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3047                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3048                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3049                            .dwattr $C$DW$184, DW_AT_decl_line(0x2f9)
    3050                            .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    3051                    
    3052                    $C$DW$185       .dwtag  DW_TAG_member
    3053                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$28)
    3054                            .dwattr $C$DW$185, DW_AT_name("LOAD")
    3055                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("LOAD")
    3056                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3057                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3058                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3059                            .dwattr $C$DW$185, DW_AT_decl_line(0x2fa)
    3060                            .dwattr $C$DW$185, DW_AT_decl_column(0x12)
    3061                    
    3062                    $C$DW$186       .dwtag  DW_TAG_member
    3063                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$28)
    3064                            .dwattr $C$DW$186, DW_AT_name("VAL")
    3065                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("VAL")
    3066                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3067                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3068                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3069                            .dwattr $C$DW$186, DW_AT_decl_line(0x2fb)
    3070                            .dwattr $C$DW$186, DW_AT_decl_column(0x12)
    3071                    
    3072                    $C$DW$187       .dwtag  DW_TAG_member
    3073                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$38)
    3074                            .dwattr $C$DW$187, DW_AT_name("CALIB")
    3075                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("CALIB")
    3076                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3077                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3078                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3079                            .dwattr $C$DW$187, DW_AT_decl_line(0x2fc)
    3080                            .dwattr $C$DW$187, DW_AT_decl_column(0x12)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   57

    3081                    
    3082                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_par
    3083                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2f8)
    3084                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    3085                            .dwendtag $C$DW$T$47
    3086                    
    3087                    $C$DW$T$330     .dwtag  DW_TAG_typedef
    3088                            .dwattr $C$DW$T$330, DW_AT_name("SysTick_Type")
    3089                            .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$47)
    3090                            .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
    3091                            .dwattr $C$DW$T$330, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    3092                            .dwattr $C$DW$T$330, DW_AT_decl_line(0x2fd)
    3093                            .dwattr $C$DW$T$330, DW_AT_decl_column(0x03)
    3094                    
    3095                    
    3096                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3097                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x1000)
    3098                    $C$DW$188       .dwtag  DW_TAG_member
    3099                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$49)
    3100                            .dwattr $C$DW$188, DW_AT_name("PORT")
    3101                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("PORT")
    3102                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3103                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3104                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3105                            .dwattr $C$DW$188, DW_AT_decl_line(0x332)
    3106                            .dwattr $C$DW$188, DW_AT_decl_column(0x06)
    3107                    
    3108                    $C$DW$189       .dwtag  DW_TAG_member
    3109                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$50)
    3110                            .dwattr $C$DW$189, DW_AT_name("RESERVED0")
    3111                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("RESERVED0")
    3112                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3113                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3114                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3115                            .dwattr $C$DW$189, DW_AT_decl_line(0x333)
    3116                            .dwattr $C$DW$189, DW_AT_decl_column(0x12)
    3117                    
    3118                    $C$DW$190       .dwtag  DW_TAG_member
    3119                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$28)
    3120                            .dwattr $C$DW$190, DW_AT_name("TER")
    3121                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("TER")
    3122                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    3123                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3124                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3125                            .dwattr $C$DW$190, DW_AT_decl_line(0x334)
    3126                            .dwattr $C$DW$190, DW_AT_decl_column(0x12)
    3127                    
    3128                    $C$DW$191       .dwtag  DW_TAG_member
    3129                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$51)
    3130                            .dwattr $C$DW$191, DW_AT_name("RESERVED1")
    3131                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("RESERVED1")
    3132                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
    3133                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3134                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3135                            .dwattr $C$DW$191, DW_AT_decl_line(0x335)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   58

    3136                            .dwattr $C$DW$191, DW_AT_decl_column(0x12)
    3137                    
    3138                    $C$DW$192       .dwtag  DW_TAG_member
    3139                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$28)
    3140                            .dwattr $C$DW$192, DW_AT_name("TPR")
    3141                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("TPR")
    3142                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
    3143                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3144                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3145                            .dwattr $C$DW$192, DW_AT_decl_line(0x336)
    3146                            .dwattr $C$DW$192, DW_AT_decl_column(0x12)
    3147                    
    3148                    $C$DW$193       .dwtag  DW_TAG_member
    3149                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$51)
    3150                            .dwattr $C$DW$193, DW_AT_name("RESERVED2")
    3151                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("RESERVED2")
    3152                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
    3153                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3154                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3155                            .dwattr $C$DW$193, DW_AT_decl_line(0x337)
    3156                            .dwattr $C$DW$193, DW_AT_decl_column(0x12)
    3157                    
    3158                    $C$DW$194       .dwtag  DW_TAG_member
    3159                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$28)
    3160                            .dwattr $C$DW$194, DW_AT_name("TCR")
    3161                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("TCR")
    3162                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
    3163                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3164                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3165                            .dwattr $C$DW$194, DW_AT_decl_line(0x338)
    3166                            .dwattr $C$DW$194, DW_AT_decl_column(0x12)
    3167                    
    3168                    $C$DW$195       .dwtag  DW_TAG_member
    3169                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$52)
    3170                            .dwattr $C$DW$195, DW_AT_name("RESERVED3")
    3171                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("RESERVED3")
    3172                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
    3173                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3174                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3175                            .dwattr $C$DW$195, DW_AT_decl_line(0x339)
    3176                            .dwattr $C$DW$195, DW_AT_decl_column(0x12)
    3177                    
    3178                    $C$DW$196       .dwtag  DW_TAG_member
    3179                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$53)
    3180                            .dwattr $C$DW$196, DW_AT_name("RESERVED4")
    3181                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("RESERVED4")
    3182                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
    3183                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3184                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3185                            .dwattr $C$DW$196, DW_AT_decl_line(0x33a)
    3186                            .dwattr $C$DW$196, DW_AT_decl_column(0x12)
    3187                    
    3188                    $C$DW$197       .dwtag  DW_TAG_member
    3189                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$28)
    3190                            .dwattr $C$DW$197, DW_AT_name("LAR")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   59

    3191                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("LAR")
    3192                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
    3193                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3194                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3195                            .dwattr $C$DW$197, DW_AT_decl_line(0x33b)
    3196                            .dwattr $C$DW$197, DW_AT_decl_column(0x12)
    3197                    
    3198                    $C$DW$198       .dwtag  DW_TAG_member
    3199                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$38)
    3200                            .dwattr $C$DW$198, DW_AT_name("LSR")
    3201                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("LSR")
    3202                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
    3203                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3204                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3205                            .dwattr $C$DW$198, DW_AT_decl_line(0x33c)
    3206                            .dwattr $C$DW$198, DW_AT_decl_column(0x12)
    3207                    
    3208                    $C$DW$199       .dwtag  DW_TAG_member
    3209                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$54)
    3210                            .dwattr $C$DW$199, DW_AT_name("RESERVED5")
    3211                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("RESERVED5")
    3212                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb8]
    3213                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3214                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3215                            .dwattr $C$DW$199, DW_AT_decl_line(0x33d)
    3216                            .dwattr $C$DW$199, DW_AT_decl_column(0x12)
    3217                    
    3218                    $C$DW$200       .dwtag  DW_TAG_member
    3219                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$38)
    3220                            .dwattr $C$DW$200, DW_AT_name("PID4")
    3221                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("PID4")
    3222                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd0]
    3223                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3224                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3225                            .dwattr $C$DW$200, DW_AT_decl_line(0x33e)
    3226                            .dwattr $C$DW$200, DW_AT_decl_column(0x12)
    3227                    
    3228                    $C$DW$201       .dwtag  DW_TAG_member
    3229                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$38)
    3230                            .dwattr $C$DW$201, DW_AT_name("PID5")
    3231                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("PID5")
    3232                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd4]
    3233                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3234                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3235                            .dwattr $C$DW$201, DW_AT_decl_line(0x33f)
    3236                            .dwattr $C$DW$201, DW_AT_decl_column(0x12)
    3237                    
    3238                    $C$DW$202       .dwtag  DW_TAG_member
    3239                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$38)
    3240                            .dwattr $C$DW$202, DW_AT_name("PID6")
    3241                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("PID6")
    3242                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd8]
    3243                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3244                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3245                            .dwattr $C$DW$202, DW_AT_decl_line(0x340)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   60

    3246                            .dwattr $C$DW$202, DW_AT_decl_column(0x12)
    3247                    
    3248                    $C$DW$203       .dwtag  DW_TAG_member
    3249                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$38)
    3250                            .dwattr $C$DW$203, DW_AT_name("PID7")
    3251                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("PID7")
    3252                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xfdc]
    3253                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3254                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3255                            .dwattr $C$DW$203, DW_AT_decl_line(0x341)
    3256                            .dwattr $C$DW$203, DW_AT_decl_column(0x12)
    3257                    
    3258                    $C$DW$204       .dwtag  DW_TAG_member
    3259                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$38)
    3260                            .dwattr $C$DW$204, DW_AT_name("PID0")
    3261                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("PID0")
    3262                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe0]
    3263                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3264                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3265                            .dwattr $C$DW$204, DW_AT_decl_line(0x342)
    3266                            .dwattr $C$DW$204, DW_AT_decl_column(0x12)
    3267                    
    3268                    $C$DW$205       .dwtag  DW_TAG_member
    3269                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$38)
    3270                            .dwattr $C$DW$205, DW_AT_name("PID1")
    3271                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("PID1")
    3272                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe4]
    3273                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3274                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3275                            .dwattr $C$DW$205, DW_AT_decl_line(0x343)
    3276                            .dwattr $C$DW$205, DW_AT_decl_column(0x12)
    3277                    
    3278                    $C$DW$206       .dwtag  DW_TAG_member
    3279                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$38)
    3280                            .dwattr $C$DW$206, DW_AT_name("PID2")
    3281                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("PID2")
    3282                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe8]
    3283                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3284                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3285                            .dwattr $C$DW$206, DW_AT_decl_line(0x344)
    3286                            .dwattr $C$DW$206, DW_AT_decl_column(0x12)
    3287                    
    3288                    $C$DW$207       .dwtag  DW_TAG_member
    3289                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$38)
    3290                            .dwattr $C$DW$207, DW_AT_name("PID3")
    3291                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("PID3")
    3292                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xfec]
    3293                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3294                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3295                            .dwattr $C$DW$207, DW_AT_decl_line(0x345)
    3296                            .dwattr $C$DW$207, DW_AT_decl_column(0x12)
    3297                    
    3298                    $C$DW$208       .dwtag  DW_TAG_member
    3299                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$38)
    3300                            .dwattr $C$DW$208, DW_AT_name("CID0")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{5BC1C2CB-6007-4F7D-BCAB-7BD0A50B3C95} PAGE   61

    3301                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("CID0")
    3302                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xff0]
    3303                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3304                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3305                            .dwattr $C$DW$208, DW_AT_decl_line(0x346)
    3306                            .dwattr $C$DW$208, DW_AT_decl_column(0x12)
    3307                    
    3308                    $C$DW$209       .dwtag  DW_TAG_member
    3309                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$38)
    3310                            .dwattr $C$DW$209, DW_AT_name("CID1")
    3311                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("CID1")
    3312                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xff4]
    3313                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3314                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3315                            .dwattr $C$DW$209, DW_AT_decl_line(0x347)
    3316                            .dwattr $C$DW$209, DW_AT_decl_column(0x12)
    3317                    
    3318                    $C$DW$210       .dwtag  DW_TAG_member
    3319                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$38)
    3320                            .dwattr $C$DW$210, DW_AT_name("CID2")
    3321                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("CID2")
    3322                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xff8]
    3323                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3324                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    3325                            .dwattr $C$DW$210, DW_AT_decl_line(0x348)
    3326                            .dwattr $C$DW$210, DW_AT_decl_column(0x12)
    3327                    
