TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.0.LTS *
       3                    ;* Date/Time created: Sat Apr 17 13:50:07 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../system_msp432p401r.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.0.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\pschaumont\git_ecedhawebinar\ecedhawebinar\msp432_l
      13                            .global SystemCoreClock
      14 00000000                   .data

C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   12

     606 00000258 6000F243          MOVW      A1, #13824            ; [DPU_V7M3_PIPE] |211|  ; [KEEP 32-BIT INS]
     607 0000025c 0100F240!         MOVW      A2, SystemCoreClock+0 ; [DPU_V7M3_PIPE] |211|  ; [KEEP 32-BIT INS]
     608 00000260 106EF2C0          MOVT      A1, #366              ; [DPU_V7M3_PIPE] |211|  ; [KEEP 32-BIT INS]
     609 00000264 0100F2C0!         MOVT      A2, SystemCoreClock+0 ; [DPU_V7M3_PIPE] |211|  ; [KEEP 32-BIT INS]
     610 00000268 F0FEFBB0          UDIV      A1, A1, LR            ; [DPU_V7M3_PIPE] |211|  ; [KEEP 32-BIT INS]
     611 0000026c 6008              STR       A1, [A2, #0]          ; [DPU_V7M3_PIPE] |211|  ; [ORIG 16-BIT INS]
     612                    $C$DW$18        .dwtag  DW_TAG_TI_branch
     613                            .dwattr $C$DW$18, DW_AT_low_pc(0x00)
     614                            .dwattr $C$DW$18, DW_AT_TI_return
     615                    
     616 0000026e 81C0E8BD          POP       {V3, V4, V5, PC}      ; [DPU_V7M3_PIPE]  ; [KEEP 32-BIT INS]
     617                            .dwcfi  cfa_offset, 0
     618                            .dwcfi  restore_reg, 8
     619                            .dwcfi  restore_reg, 7
     620                            .dwcfi  restore_reg, 6
     621                            ; BRANCH OCCURS                  ; [] 
     622                            .dwcfi  restore_state
     623                    ;* --------------------------------------------------------------------------*
     624                            .align  8
     625 00000278           ||$C$L18||:    
     626                            .dwpsn  file "../system_msp432p401r.c",line 143,column 9,is_stmt,isa 1
     627 00000278 0100F240!         MOVW      A2, SystemCoreClock+0 ; [DPU_V7M3_PIPE] |143|  ; [KEEP 32-BIT INS]
     628 0000027c 7010F242          MOV       A1, #10000            ; [DPU_V7M3_PIPE] |143|  ; [KEEP 32-BIT INS]
     629 00000280 0100F2C0!         MOVT      A2, SystemCoreClock+0 ; [DPU_V7M3_PIPE] |143|  ; [KEEP 32-BIT INS]
     630 00000284 F0FEFBB0          UDIV      A1, A1, LR            ; [DPU_V7M3_PIPE] |143|  ; [KEEP 32-BIT INS]
     631 00000288 6008              STR       A1, [A2, #0]          ; [DPU_V7M3_PIPE] |143|  ; [ORIG 16-BIT INS]
     632                    ;* --------------------------------------------------------------------------*
     633                    ||$C$L19||:    
     634                    $C$DW$19        .dwtag  DW_TAG_TI_branch
     635                            .dwattr $C$DW$19, DW_AT_low_pc(0x00)
     636                            .dwattr $C$DW$19, DW_AT_TI_return
     637                    
     638 0000028a 81C0E8BD          POP       {V3, V4, V5, PC}      ; [DPU_V7M3_PIPE]  ; [KEEP 32-BIT INS]
     639                            .dwcfi  cfa_offset, 0
     640                            .dwcfi  restore_reg, 8
     641                            .dwcfi  restore_reg, 7
     642                            .dwcfi  restore_reg, 6
     643                            ; BRANCH OCCURS                  ; [] 
     644                            .dwattr $C$DW$4, DW_AT_TI_end_file("../system_msp432p401r.c")
     645                            .dwattr $C$DW$4, DW_AT_TI_end_line(0xf3)
     646                            .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     647                            .dwendentry
     648                            .dwendtag $C$DW$4
     649                    
     650                    
     651                    ;******************************************************************************
     652                    ;* BUILD ATTRIBUTES                                                           *
     653                    ;******************************************************************************
     654                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     655                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     656                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     657                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     658                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     659                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     660                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(2)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   13

     661                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     662                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     663                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     664                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     665                    
     666                    ;******************************************************************************
     667                    ;* TYPE INFORMATION                                                           *
     668                    ;******************************************************************************
     669                    
     670                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
     671                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x68)
     672                    $C$DW$20        .dwtag  DW_TAG_member
     673                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$23)
     674                            .dwattr $C$DW$20, DW_AT_name("KEY")
     675                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("KEY")
     676                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     678                            .dwattr $C$DW$20, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     679                            .dwattr $C$DW$20, DW_AT_decl_line(0x1d9)
     680                            .dwattr $C$DW$20, DW_AT_decl_column(0x11)
     681                    
     682                    $C$DW$21        .dwtag  DW_TAG_member
     683                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$23)
     684                            .dwattr $C$DW$21, DW_AT_name("CTL0")
     685                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("CTL0")
     686                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     687                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     688                            .dwattr $C$DW$21, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     689                            .dwattr $C$DW$21, DW_AT_decl_line(0x1da)
     690                            .dwattr $C$DW$21, DW_AT_decl_column(0x11)
     691                    
     692                    $C$DW$22        .dwtag  DW_TAG_member
     693                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$23)
     694                            .dwattr $C$DW$22, DW_AT_name("CTL1")
     695                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("CTL1")
     696                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     697                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     698                            .dwattr $C$DW$22, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     699                            .dwattr $C$DW$22, DW_AT_decl_line(0x1db)
     700                            .dwattr $C$DW$22, DW_AT_decl_column(0x11)
     701                    
     702                    $C$DW$23        .dwtag  DW_TAG_member
     703                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$23)
     704                            .dwattr $C$DW$23, DW_AT_name("CTL2")
     705                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("CTL2")
     706                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     707                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     708                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     709                            .dwattr $C$DW$23, DW_AT_decl_line(0x1dc)
     710                            .dwattr $C$DW$23, DW_AT_decl_column(0x11)
     711                    
     712                    $C$DW$24        .dwtag  DW_TAG_member
     713                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$23)
     714                            .dwattr $C$DW$24, DW_AT_name("CTL3")
     715                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("CTL3")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   14

     716                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     717                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     718                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     719                            .dwattr $C$DW$24, DW_AT_decl_line(0x1dd)
     720                            .dwattr $C$DW$24, DW_AT_decl_column(0x11)
     721                    
     722                    $C$DW$25        .dwtag  DW_TAG_member
     723                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$24)
     724                            .dwattr $C$DW$25, DW_AT_name("RESERVED0")
     725                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("RESERVED0")
     726                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     727                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     728                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     729                            .dwattr $C$DW$25, DW_AT_decl_line(0x1de)
     730                            .dwattr $C$DW$25, DW_AT_decl_column(0x11)
     731                    
     732                    $C$DW$26        .dwtag  DW_TAG_member
     733                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$23)
     734                            .dwattr $C$DW$26, DW_AT_name("CLKEN")
     735                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("CLKEN")
     736                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     737                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     738                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     739                            .dwattr $C$DW$26, DW_AT_decl_line(0x1df)
     740                            .dwattr $C$DW$26, DW_AT_decl_column(0x11)
     741                    
     742                    $C$DW$27        .dwtag  DW_TAG_member
     743                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$25)
     744                            .dwattr $C$DW$27, DW_AT_name("STAT")
     745                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("STAT")
     746                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     747                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     748                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     749                            .dwattr $C$DW$27, DW_AT_decl_line(0x1e0)
     750                            .dwattr $C$DW$27, DW_AT_decl_column(0x11)
     751                    
     752                    $C$DW$28        .dwtag  DW_TAG_member
     753                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$26)
     754                            .dwattr $C$DW$28, DW_AT_name("RESERVED1")
     755                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("RESERVED1")
     756                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     757                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     758                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     759                            .dwattr $C$DW$28, DW_AT_decl_line(0x1e1)
     760                            .dwattr $C$DW$28, DW_AT_decl_column(0x11)
     761                    
     762                    $C$DW$29        .dwtag  DW_TAG_member
     763                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$23)
     764                            .dwattr $C$DW$29, DW_AT_name("IE")
     765                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("IE")
     766                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     767                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     768                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     769                            .dwattr $C$DW$29, DW_AT_decl_line(0x1e2)
     770                            .dwattr $C$DW$29, DW_AT_decl_column(0x11)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   15

     771                    
     772                    $C$DW$30        .dwtag  DW_TAG_member
     773                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$22)
     774                            .dwattr $C$DW$30, DW_AT_name("RESERVED2")
     775                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("RESERVED2")
     776                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     777                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     778                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     779                            .dwattr $C$DW$30, DW_AT_decl_line(0x1e3)
     780                            .dwattr $C$DW$30, DW_AT_decl_column(0x11)
     781                    
     782                    $C$DW$31        .dwtag  DW_TAG_member
     783                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$25)
     784                            .dwattr $C$DW$31, DW_AT_name("IFG")
     785                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("IFG")
     786                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     787                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     788                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     789                            .dwattr $C$DW$31, DW_AT_decl_line(0x1e4)
     790                            .dwattr $C$DW$31, DW_AT_decl_column(0x11)
     791                    
     792                    $C$DW$32        .dwtag  DW_TAG_member
     793                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
     794                            .dwattr $C$DW$32, DW_AT_name("RESERVED3")
     795                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("RESERVED3")
     796                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     797                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     798                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     799                            .dwattr $C$DW$32, DW_AT_decl_line(0x1e5)
     800                            .dwattr $C$DW$32, DW_AT_decl_column(0x11)
     801                    
     802                    $C$DW$33        .dwtag  DW_TAG_member
     803                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$23)
     804                            .dwattr $C$DW$33, DW_AT_name("CLRIFG")
     805                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("CLRIFG")
     806                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     807                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     808                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     809                            .dwattr $C$DW$33, DW_AT_decl_line(0x1e6)
     810                            .dwattr $C$DW$33, DW_AT_decl_column(0x11)
     811                    
     812                    $C$DW$34        .dwtag  DW_TAG_member
     813                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
     814                            .dwattr $C$DW$34, DW_AT_name("RESERVED4")
     815                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("RESERVED4")
     816                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     817                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     818                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     819                            .dwattr $C$DW$34, DW_AT_decl_line(0x1e7)
     820                            .dwattr $C$DW$34, DW_AT_decl_column(0x11)
     821                    
     822                    $C$DW$35        .dwtag  DW_TAG_member
     823                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$23)
     824                            .dwattr $C$DW$35, DW_AT_name("SETIFG")
     825                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("SETIFG")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   16

     826                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     827                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     828                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     829                            .dwattr $C$DW$35, DW_AT_decl_line(0x1e8)
     830                            .dwattr $C$DW$35, DW_AT_decl_column(0x11)
     831                    
     832                    $C$DW$36        .dwtag  DW_TAG_member
     833                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$22)
     834                            .dwattr $C$DW$36, DW_AT_name("RESERVED5")
     835                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("RESERVED5")
     836                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     837                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     838                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     839                            .dwattr $C$DW$36, DW_AT_decl_line(0x1e9)
     840                            .dwattr $C$DW$36, DW_AT_decl_column(0x11)
     841                    
     842                    $C$DW$37        .dwtag  DW_TAG_member
     843                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$23)
     844                            .dwattr $C$DW$37, DW_AT_name("DCOERCAL0")
     845                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("DCOERCAL0")
     846                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     847                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     848                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     849                            .dwattr $C$DW$37, DW_AT_decl_line(0x1ea)
     850                            .dwattr $C$DW$37, DW_AT_decl_column(0x11)
     851                    
     852                    $C$DW$38        .dwtag  DW_TAG_member
     853                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$23)
     854                            .dwattr $C$DW$38, DW_AT_name("DCOERCAL1")
     855                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("DCOERCAL1")
     856                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     857                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     858                            .dwattr $C$DW$38, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     859                            .dwattr $C$DW$38, DW_AT_decl_line(0x1eb)
     860                            .dwattr $C$DW$38, DW_AT_decl_column(0x11)
     861                    
     862                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\device
     863                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x1d8)
     864                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     865                            .dwendtag $C$DW$T$27
     866                    
     867                    $C$DW$T$184     .dwtag  DW_TAG_typedef
     868                            .dwattr $C$DW$T$184, DW_AT_name("CS_Type")
     869                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$27)
     870                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
     871                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devic
     872                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x1ec)
     873                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x03)
     874                    
     875                    
     876                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     877                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x14c)
     878                    $C$DW$39        .dwtag  DW_TAG_member
     879                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$25)
     880                            .dwattr $C$DW$39, DW_AT_name("TLV_CHECKSUM")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   17

     881                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("TLV_CHECKSUM")
     882                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     884                            .dwattr $C$DW$39, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     885                            .dwattr $C$DW$39, DW_AT_decl_line(0x4c4)
     886                            .dwattr $C$DW$39, DW_AT_decl_column(0x11)
     887                    
     888                    $C$DW$40        .dwtag  DW_TAG_member
     889                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$25)
     890                            .dwattr $C$DW$40, DW_AT_name("DEVICE_INFO_TAG")
     891                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("DEVICE_INFO_TAG")
     892                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     893                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     894                            .dwattr $C$DW$40, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     895                            .dwattr $C$DW$40, DW_AT_decl_line(0x4c5)
     896                            .dwattr $C$DW$40, DW_AT_decl_column(0x11)
     897                    
     898                    $C$DW$41        .dwtag  DW_TAG_member
     899                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$25)
     900                            .dwattr $C$DW$41, DW_AT_name("DEVICE_INFO_LEN")
     901                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("DEVICE_INFO_LEN")
     902                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     903                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     904                            .dwattr $C$DW$41, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     905                            .dwattr $C$DW$41, DW_AT_decl_line(0x4c6)
     906                            .dwattr $C$DW$41, DW_AT_decl_column(0x11)
     907                    
     908                    $C$DW$42        .dwtag  DW_TAG_member
     909                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$25)
     910                            .dwattr $C$DW$42, DW_AT_name("DEVICE_ID")
     911                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("DEVICE_ID")
     912                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     913                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     914                            .dwattr $C$DW$42, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     915                            .dwattr $C$DW$42, DW_AT_decl_line(0x4c7)
     916                            .dwattr $C$DW$42, DW_AT_decl_column(0x11)
     917                    
     918                    $C$DW$43        .dwtag  DW_TAG_member
     919                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$25)
     920                            .dwattr $C$DW$43, DW_AT_name("HWREV")
     921                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("HWREV")
     922                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     923                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     924                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     925                            .dwattr $C$DW$43, DW_AT_decl_line(0x4c8)
     926                            .dwattr $C$DW$43, DW_AT_decl_column(0x11)
     927                    
     928                    $C$DW$44        .dwtag  DW_TAG_member
     929                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$25)
     930                            .dwattr $C$DW$44, DW_AT_name("BCREV")
     931                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("BCREV")
     932                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     933                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     934                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     935                            .dwattr $C$DW$44, DW_AT_decl_line(0x4c9)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   18

     936                            .dwattr $C$DW$44, DW_AT_decl_column(0x11)
     937                    
     938                    $C$DW$45        .dwtag  DW_TAG_member
     939                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$25)
     940                            .dwattr $C$DW$45, DW_AT_name("ROM_DRVLIB_REV")
     941                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("ROM_DRVLIB_REV")
     942                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     943                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     944                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     945                            .dwattr $C$DW$45, DW_AT_decl_line(0x4ca)
     946                            .dwattr $C$DW$45, DW_AT_decl_column(0x11)
     947                    
     948                    $C$DW$46        .dwtag  DW_TAG_member
     949                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$25)
     950                            .dwattr $C$DW$46, DW_AT_name("DIE_REC_TAG")
     951                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("DIE_REC_TAG")
     952                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     953                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     954                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     955                            .dwattr $C$DW$46, DW_AT_decl_line(0x4cb)
     956                            .dwattr $C$DW$46, DW_AT_decl_column(0x11)
     957                    
     958                    $C$DW$47        .dwtag  DW_TAG_member
     959                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$25)
     960                            .dwattr $C$DW$47, DW_AT_name("DIE_REC_LEN")
     961                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("DIE_REC_LEN")
     962                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     963                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     964                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     965                            .dwattr $C$DW$47, DW_AT_decl_line(0x4cc)
     966                            .dwattr $C$DW$47, DW_AT_decl_column(0x11)
     967                    
     968                    $C$DW$48        .dwtag  DW_TAG_member
     969                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$25)
     970                            .dwattr $C$DW$48, DW_AT_name("DIE_XPOS")
     971                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("DIE_XPOS")
     972                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     973                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     974                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     975                            .dwattr $C$DW$48, DW_AT_decl_line(0x4cd)
     976                            .dwattr $C$DW$48, DW_AT_decl_column(0x11)
     977                    
     978                    $C$DW$49        .dwtag  DW_TAG_member
     979                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$25)
     980                            .dwattr $C$DW$49, DW_AT_name("DIE_YPOS")
     981                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("DIE_YPOS")
     982                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     983                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     984                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     985                            .dwattr $C$DW$49, DW_AT_decl_line(0x4ce)
     986                            .dwattr $C$DW$49, DW_AT_decl_column(0x11)
     987                    
     988                    $C$DW$50        .dwtag  DW_TAG_member
     989                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$25)
     990                            .dwattr $C$DW$50, DW_AT_name("WAFER_ID")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   19

     991                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("WAFER_ID")
     992                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     993                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     994                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
     995                            .dwattr $C$DW$50, DW_AT_decl_line(0x4cf)
     996                            .dwattr $C$DW$50, DW_AT_decl_column(0x11)
     997                    
     998                    $C$DW$51        .dwtag  DW_TAG_member
     999                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$25)
    1000                            .dwattr $C$DW$51, DW_AT_name("LOT_ID")
    1001                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("LOT_ID")
    1002                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1003                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1004                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1005                            .dwattr $C$DW$51, DW_AT_decl_line(0x4d0)
    1006                            .dwattr $C$DW$51, DW_AT_decl_column(0x11)
    1007                    
    1008                    $C$DW$52        .dwtag  DW_TAG_member
    1009                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$25)
    1010                            .dwattr $C$DW$52, DW_AT_name("RESERVED0")
    1011                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("RESERVED0")
    1012                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1013                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1014                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1015                            .dwattr $C$DW$52, DW_AT_decl_line(0x4d1)
    1016                            .dwattr $C$DW$52, DW_AT_decl_column(0x11)
    1017                    
    1018                    $C$DW$53        .dwtag  DW_TAG_member
    1019                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$25)
    1020                            .dwattr $C$DW$53, DW_AT_name("RESERVED1")
    1021                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("RESERVED1")
    1022                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1023                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1024                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1025                            .dwattr $C$DW$53, DW_AT_decl_line(0x4d2)
    1026                            .dwattr $C$DW$53, DW_AT_decl_column(0x11)
    1027                    
    1028                    $C$DW$54        .dwtag  DW_TAG_member
    1029                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$25)
    1030                            .dwattr $C$DW$54, DW_AT_name("RESERVED2")
    1031                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED2")
    1032                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1033                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1034                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1035                            .dwattr $C$DW$54, DW_AT_decl_line(0x4d3)
    1036                            .dwattr $C$DW$54, DW_AT_decl_column(0x11)
    1037                    
    1038                    $C$DW$55        .dwtag  DW_TAG_member
    1039                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$25)
    1040                            .dwattr $C$DW$55, DW_AT_name("TEST_RESULTS")
    1041                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("TEST_RESULTS")
    1042                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1043                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1044                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1045                            .dwattr $C$DW$55, DW_AT_decl_line(0x4d4)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   20

    1046                            .dwattr $C$DW$55, DW_AT_decl_column(0x11)
    1047                    
    1048                    $C$DW$56        .dwtag  DW_TAG_member
    1049                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$25)
    1050                            .dwattr $C$DW$56, DW_AT_name("CS_CAL_TAG")
    1051                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("CS_CAL_TAG")
    1052                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1053                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1054                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1055                            .dwattr $C$DW$56, DW_AT_decl_line(0x4d5)
    1056                            .dwattr $C$DW$56, DW_AT_decl_column(0x11)
    1057                    
    1058                    $C$DW$57        .dwtag  DW_TAG_member
    1059                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$25)
    1060                            .dwattr $C$DW$57, DW_AT_name("CS_CAL_LEN")
    1061                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("CS_CAL_LEN")
    1062                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1063                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1064                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1065                            .dwattr $C$DW$57, DW_AT_decl_line(0x4d6)
    1066                            .dwattr $C$DW$57, DW_AT_decl_column(0x11)
    1067                    
    1068                    $C$DW$58        .dwtag  DW_TAG_member
    1069                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$25)
    1070                            .dwattr $C$DW$58, DW_AT_name("DCOIR_FCAL_RSEL04")
    1071                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL04")
    1072                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1073                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1074                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1075                            .dwattr $C$DW$58, DW_AT_decl_line(0x4d7)
    1076                            .dwattr $C$DW$58, DW_AT_decl_column(0x11)
    1077                    
    1078                    $C$DW$59        .dwtag  DW_TAG_member
    1079                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$25)
    1080                            .dwattr $C$DW$59, DW_AT_name("DCOIR_FCAL_RSEL5")
    1081                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL5")
    1082                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1083                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1084                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1085                            .dwattr $C$DW$59, DW_AT_decl_line(0x4d8)
    1086                            .dwattr $C$DW$59, DW_AT_decl_column(0x11)
    1087                    
    1088                    $C$DW$60        .dwtag  DW_TAG_member
    1089                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$25)
    1090                            .dwattr $C$DW$60, DW_AT_name("RESERVED3")
    1091                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("RESERVED3")
    1092                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1093                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1094                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1095                            .dwattr $C$DW$60, DW_AT_decl_line(0x4d9)
    1096                            .dwattr $C$DW$60, DW_AT_decl_column(0x11)
    1097                    
    1098                    $C$DW$61        .dwtag  DW_TAG_member
    1099                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$25)
    1100                            .dwattr $C$DW$61, DW_AT_name("RESERVED4")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   21

    1101                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("RESERVED4")
    1102                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1103                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1104                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1105                            .dwattr $C$DW$61, DW_AT_decl_line(0x4da)
    1106                            .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1107                    
    1108                    $C$DW$62        .dwtag  DW_TAG_member
    1109                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
    1110                            .dwattr $C$DW$62, DW_AT_name("RESERVED5")
    1111                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED5")
    1112                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1113                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1114                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1115                            .dwattr $C$DW$62, DW_AT_decl_line(0x4db)
    1116                            .dwattr $C$DW$62, DW_AT_decl_column(0x11)
    1117                    
    1118                    $C$DW$63        .dwtag  DW_TAG_member
    1119                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$25)
    1120                            .dwattr $C$DW$63, DW_AT_name("RESERVED6")
    1121                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("RESERVED6")
    1122                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1123                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1124                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1125                            .dwattr $C$DW$63, DW_AT_decl_line(0x4dc)
    1126                            .dwattr $C$DW$63, DW_AT_decl_column(0x11)
    1127                    
    1128                    $C$DW$64        .dwtag  DW_TAG_member
    1129                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$25)
    1130                            .dwattr $C$DW$64, DW_AT_name("DCOIR_CONSTK_RSEL04")
    1131                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL04")
    1132                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1133                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1134                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1135                            .dwattr $C$DW$64, DW_AT_decl_line(0x4dd)
    1136                            .dwattr $C$DW$64, DW_AT_decl_column(0x11)
    1137                    
    1138                    $C$DW$65        .dwtag  DW_TAG_member
    1139                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$25)
    1140                            .dwattr $C$DW$65, DW_AT_name("DCOIR_CONSTK_RSEL5")
    1141                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL5")
    1142                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1143                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1144                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1145                            .dwattr $C$DW$65, DW_AT_decl_line(0x4de)
    1146                            .dwattr $C$DW$65, DW_AT_decl_column(0x11)
    1147                    
    1148                    $C$DW$66        .dwtag  DW_TAG_member
    1149                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$25)
    1150                            .dwattr $C$DW$66, DW_AT_name("DCOER_FCAL_RSEL04")
    1151                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL04")
    1152                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1153                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1154                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1155                            .dwattr $C$DW$66, DW_AT_decl_line(0x4df)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   22

    1156                            .dwattr $C$DW$66, DW_AT_decl_column(0x11)
    1157                    
    1158                    $C$DW$67        .dwtag  DW_TAG_member
    1159                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$25)
    1160                            .dwattr $C$DW$67, DW_AT_name("DCOER_FCAL_RSEL5")
    1161                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL5")
    1162                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1163                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1164                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1165                            .dwattr $C$DW$67, DW_AT_decl_line(0x4e0)
    1166                            .dwattr $C$DW$67, DW_AT_decl_column(0x11)
    1167                    
    1168                    $C$DW$68        .dwtag  DW_TAG_member
    1169                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$25)
    1170                            .dwattr $C$DW$68, DW_AT_name("RESERVED7")
    1171                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("RESERVED7")
    1172                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1173                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1174                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1175                            .dwattr $C$DW$68, DW_AT_decl_line(0x4e1)
    1176                            .dwattr $C$DW$68, DW_AT_decl_column(0x11)
    1177                    
    1178                    $C$DW$69        .dwtag  DW_TAG_member
    1179                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$25)
    1180                            .dwattr $C$DW$69, DW_AT_name("RESERVED8")
    1181                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("RESERVED8")
    1182                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1183                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1184                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1185                            .dwattr $C$DW$69, DW_AT_decl_line(0x4e2)
    1186                            .dwattr $C$DW$69, DW_AT_decl_column(0x11)
    1187                    
    1188                    $C$DW$70        .dwtag  DW_TAG_member
    1189                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$25)
    1190                            .dwattr $C$DW$70, DW_AT_name("RESERVED9")
    1191                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("RESERVED9")
    1192                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1193                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1194                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1195                            .dwattr $C$DW$70, DW_AT_decl_line(0x4e3)
    1196                            .dwattr $C$DW$70, DW_AT_decl_column(0x11)
    1197                    
    1198                    $C$DW$71        .dwtag  DW_TAG_member
    1199                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$25)
    1200                            .dwattr $C$DW$71, DW_AT_name("RESERVED10")
    1201                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED10")
    1202                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1203                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1204                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1205                            .dwattr $C$DW$71, DW_AT_decl_line(0x4e4)
    1206                            .dwattr $C$DW$71, DW_AT_decl_column(0x11)
    1207                    
    1208                    $C$DW$72        .dwtag  DW_TAG_member
    1209                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$25)
    1210                            .dwattr $C$DW$72, DW_AT_name("DCOER_CONSTK_RSEL04")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   23

    1211                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL04")
    1212                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1213                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1214                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1215                            .dwattr $C$DW$72, DW_AT_decl_line(0x4e5)
    1216                            .dwattr $C$DW$72, DW_AT_decl_column(0x11)
    1217                    
    1218                    $C$DW$73        .dwtag  DW_TAG_member
    1219                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$25)
    1220                            .dwattr $C$DW$73, DW_AT_name("DCOER_CONSTK_RSEL5")
    1221                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL5")
    1222                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1223                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1224                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1225                            .dwattr $C$DW$73, DW_AT_decl_line(0x4e6)
    1226                            .dwattr $C$DW$73, DW_AT_decl_column(0x11)
    1227                    
    1228                    $C$DW$74        .dwtag  DW_TAG_member
    1229                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$25)
    1230                            .dwattr $C$DW$74, DW_AT_name("ADC14_CAL_TAG")
    1231                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("ADC14_CAL_TAG")
    1232                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1233                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1234                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1235                            .dwattr $C$DW$74, DW_AT_decl_line(0x4e7)
    1236                            .dwattr $C$DW$74, DW_AT_decl_column(0x11)
    1237                    
    1238                    $C$DW$75        .dwtag  DW_TAG_member
    1239                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$25)
    1240                            .dwattr $C$DW$75, DW_AT_name("ADC14_CAL_LEN")
    1241                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("ADC14_CAL_LEN")
    1242                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1243                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1244                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1245                            .dwattr $C$DW$75, DW_AT_decl_line(0x4e8)
    1246                            .dwattr $C$DW$75, DW_AT_decl_column(0x11)
    1247                    
    1248                    $C$DW$76        .dwtag  DW_TAG_member
    1249                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$25)
    1250                            .dwattr $C$DW$76, DW_AT_name("ADC_GAIN_FACTOR")
    1251                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("ADC_GAIN_FACTOR")
    1252                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1253                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1254                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1255                            .dwattr $C$DW$76, DW_AT_decl_line(0x4e9)
    1256                            .dwattr $C$DW$76, DW_AT_decl_column(0x11)
    1257                    
    1258                    $C$DW$77        .dwtag  DW_TAG_member
    1259                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$25)
    1260                            .dwattr $C$DW$77, DW_AT_name("ADC_OFFSET")
    1261                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("ADC_OFFSET")
    1262                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1263                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1264                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1265                            .dwattr $C$DW$77, DW_AT_decl_line(0x4ea)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   24

    1266                            .dwattr $C$DW$77, DW_AT_decl_column(0x11)
    1267                    
    1268                    $C$DW$78        .dwtag  DW_TAG_member
    1269                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$25)
    1270                            .dwattr $C$DW$78, DW_AT_name("RESERVED11")
    1271                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("RESERVED11")
    1272                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1273                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1274                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1275                            .dwattr $C$DW$78, DW_AT_decl_line(0x4eb)
    1276                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1277                    
    1278                    $C$DW$79        .dwtag  DW_TAG_member
    1279                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$25)
    1280                            .dwattr $C$DW$79, DW_AT_name("RESERVED12")
    1281                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED12")
    1282                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1283                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1284                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1285                            .dwattr $C$DW$79, DW_AT_decl_line(0x4ec)
    1286                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
    1287                    
    1288                    $C$DW$80        .dwtag  DW_TAG_member
    1289                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$25)
    1290                            .dwattr $C$DW$80, DW_AT_name("RESERVED13")
    1291                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("RESERVED13")
    1292                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1293                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1294                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1295                            .dwattr $C$DW$80, DW_AT_decl_line(0x4ed)
    1296                            .dwattr $C$DW$80, DW_AT_decl_column(0x11)
    1297                    
    1298                    $C$DW$81        .dwtag  DW_TAG_member
    1299                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$25)
    1300                            .dwattr $C$DW$81, DW_AT_name("RESERVED14")
    1301                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED14")
    1302                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1303                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1304                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1305                            .dwattr $C$DW$81, DW_AT_decl_line(0x4ee)
    1306                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1307                    
    1308                    $C$DW$82        .dwtag  DW_TAG_member
    1309                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$25)
    1310                            .dwattr $C$DW$82, DW_AT_name("RESERVED15")
    1311                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("RESERVED15")
    1312                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1313                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1314                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1315                            .dwattr $C$DW$82, DW_AT_decl_line(0x4ef)
    1316                            .dwattr $C$DW$82, DW_AT_decl_column(0x11)
    1317                    
    1318                    $C$DW$83        .dwtag  DW_TAG_member
    1319                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$25)
    1320                            .dwattr $C$DW$83, DW_AT_name("RESERVED16")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   25

    1321                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED16")
    1322                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1323                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1324                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1325                            .dwattr $C$DW$83, DW_AT_decl_line(0x4f0)
    1326                            .dwattr $C$DW$83, DW_AT_decl_column(0x11)
    1327                    
    1328                    $C$DW$84        .dwtag  DW_TAG_member
    1329                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$25)
    1330                            .dwattr $C$DW$84, DW_AT_name("RESERVED17")
    1331                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED17")
    1332                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1333                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1334                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1335                            .dwattr $C$DW$84, DW_AT_decl_line(0x4f1)
    1336                            .dwattr $C$DW$84, DW_AT_decl_column(0x11)
    1337                    
    1338                    $C$DW$85        .dwtag  DW_TAG_member
    1339                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$25)
    1340                            .dwattr $C$DW$85, DW_AT_name("RESERVED18")
    1341                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED18")
    1342                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1343                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1344                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1345                            .dwattr $C$DW$85, DW_AT_decl_line(0x4f2)
    1346                            .dwattr $C$DW$85, DW_AT_decl_column(0x11)
    1347                    
    1348                    $C$DW$86        .dwtag  DW_TAG_member
    1349                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$25)
    1350                            .dwattr $C$DW$86, DW_AT_name("RESERVED19")
    1351                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED19")
    1352                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1353                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1354                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1355                            .dwattr $C$DW$86, DW_AT_decl_line(0x4f3)
    1356                            .dwattr $C$DW$86, DW_AT_decl_column(0x11)
    1357                    
    1358                    $C$DW$87        .dwtag  DW_TAG_member
    1359                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$25)
    1360                            .dwattr $C$DW$87, DW_AT_name("RESERVED20")
    1361                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("RESERVED20")
    1362                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1363                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1364                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1365                            .dwattr $C$DW$87, DW_AT_decl_line(0x4f4)
    1366                            .dwattr $C$DW$87, DW_AT_decl_column(0x11)
    1367                    
    1368                    $C$DW$88        .dwtag  DW_TAG_member
    1369                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$25)
    1370                            .dwattr $C$DW$88, DW_AT_name("RESERVED21")
    1371                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("RESERVED21")
    1372                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1373                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1374                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1375                            .dwattr $C$DW$88, DW_AT_decl_line(0x4f5)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   26

    1376                            .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1377                    
    1378                    $C$DW$89        .dwtag  DW_TAG_member
    1379                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
    1380                            .dwattr $C$DW$89, DW_AT_name("RESERVED22")
    1381                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("RESERVED22")
    1382                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1383                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1384                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1385                            .dwattr $C$DW$89, DW_AT_decl_line(0x4f6)
    1386                            .dwattr $C$DW$89, DW_AT_decl_column(0x11)
    1387                    
    1388                    $C$DW$90        .dwtag  DW_TAG_member
    1389                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$25)
    1390                            .dwattr $C$DW$90, DW_AT_name("RESERVED23")
    1391                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("RESERVED23")
    1392                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    1393                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1394                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1395                            .dwattr $C$DW$90, DW_AT_decl_line(0x4f7)
    1396                            .dwattr $C$DW$90, DW_AT_decl_column(0x11)
    1397                    
    1398                    $C$DW$91        .dwtag  DW_TAG_member
    1399                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$25)
    1400                            .dwattr $C$DW$91, DW_AT_name("RESERVED24")
    1401                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("RESERVED24")
    1402                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1403                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1404                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1405                            .dwattr $C$DW$91, DW_AT_decl_line(0x4f8)
    1406                            .dwattr $C$DW$91, DW_AT_decl_column(0x11)
    1407                    
    1408                    $C$DW$92        .dwtag  DW_TAG_member
    1409                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$25)
    1410                            .dwattr $C$DW$92, DW_AT_name("RESERVED25")
    1411                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("RESERVED25")
    1412                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1413                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1414                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1415                            .dwattr $C$DW$92, DW_AT_decl_line(0x4f9)
    1416                            .dwattr $C$DW$92, DW_AT_decl_column(0x11)
    1417                    
    1418                    $C$DW$93        .dwtag  DW_TAG_member
    1419                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    1420                            .dwattr $C$DW$93, DW_AT_name("RESERVED26")
    1421                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("RESERVED26")
    1422                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    1423                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1424                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1425                            .dwattr $C$DW$93, DW_AT_decl_line(0x4fa)
    1426                            .dwattr $C$DW$93, DW_AT_decl_column(0x11)
    1427                    
    1428                    $C$DW$94        .dwtag  DW_TAG_member
    1429                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$25)
    1430                            .dwattr $C$DW$94, DW_AT_name("ADC14_REF1P2V_TS30C")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   27

    1431                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS30C")
    1432                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1433                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1434                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1435                            .dwattr $C$DW$94, DW_AT_decl_line(0x4fb)
    1436                            .dwattr $C$DW$94, DW_AT_decl_column(0x11)
    1437                    
    1438                    $C$DW$95        .dwtag  DW_TAG_member
    1439                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$25)
    1440                            .dwattr $C$DW$95, DW_AT_name("ADC14_REF1P2V_TS85C")
    1441                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS85C")
    1442                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1443                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1444                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1445                            .dwattr $C$DW$95, DW_AT_decl_line(0x4fc)
    1446                            .dwattr $C$DW$95, DW_AT_decl_column(0x11)
    1447                    
    1448                    $C$DW$96        .dwtag  DW_TAG_member
    1449                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$25)
    1450                            .dwattr $C$DW$96, DW_AT_name("ADC14_REF1P45V_TS30C")
    1451                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS30C")
    1452                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    1453                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1454                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1455                            .dwattr $C$DW$96, DW_AT_decl_line(0x4fd)
    1456                            .dwattr $C$DW$96, DW_AT_decl_column(0x11)
    1457                    
    1458                    $C$DW$97        .dwtag  DW_TAG_member
    1459                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$25)
    1460                            .dwattr $C$DW$97, DW_AT_name("ADC14_REF1P45V_TS85C")
    1461                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS85C")
    1462                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1463                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1464                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1465                            .dwattr $C$DW$97, DW_AT_decl_line(0x4fe)
    1466                            .dwattr $C$DW$97, DW_AT_decl_column(0x11)
    1467                    
    1468                    $C$DW$98        .dwtag  DW_TAG_member
    1469                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$25)
    1470                            .dwattr $C$DW$98, DW_AT_name("ADC14_REF2P5V_TS30C")
    1471                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS30C")
    1472                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1473                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1474                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1475                            .dwattr $C$DW$98, DW_AT_decl_line(0x4ff)
    1476                            .dwattr $C$DW$98, DW_AT_decl_column(0x11)
    1477                    
    1478                    $C$DW$99        .dwtag  DW_TAG_member
    1479                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$25)
    1480                            .dwattr $C$DW$99, DW_AT_name("ADC14_REF2P5V_TS85C")
    1481                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS85C")
    1482                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1483                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1484                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices\
    1485                            .dwattr $C$DW$99, DW_AT_decl_line(0x500)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   28

    1486                            .dwattr $C$DW$99, DW_AT_decl_column(0x11)
    1487                    
    1488                    $C$DW$100       .dwtag  DW_TAG_member
    1489                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$25)
    1490                            .dwattr $C$DW$100, DW_AT_name("REF_CAL_TAG")
    1491                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("REF_CAL_TAG")
    1492                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1493                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1494                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1495                            .dwattr $C$DW$100, DW_AT_decl_line(0x501)
    1496                            .dwattr $C$DW$100, DW_AT_decl_column(0x11)
    1497                    
    1498                    $C$DW$101       .dwtag  DW_TAG_member
    1499                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$25)
    1500                            .dwattr $C$DW$101, DW_AT_name("REF_CAL_LEN")
    1501                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("REF_CAL_LEN")
    1502                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1503                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1504                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1505                            .dwattr $C$DW$101, DW_AT_decl_line(0x502)
    1506                            .dwattr $C$DW$101, DW_AT_decl_column(0x11)
    1507                    
    1508                    $C$DW$102       .dwtag  DW_TAG_member
    1509                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$25)
    1510                            .dwattr $C$DW$102, DW_AT_name("REF_1P2V")
    1511                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("REF_1P2V")
    1512                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    1513                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1514                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1515                            .dwattr $C$DW$102, DW_AT_decl_line(0x503)
    1516                            .dwattr $C$DW$102, DW_AT_decl_column(0x11)
    1517                    
    1518                    $C$DW$103       .dwtag  DW_TAG_member
    1519                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$25)
    1520                            .dwattr $C$DW$103, DW_AT_name("REF_1P45V")
    1521                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("REF_1P45V")
    1522                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1523                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1524                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1525                            .dwattr $C$DW$103, DW_AT_decl_line(0x504)
    1526                            .dwattr $C$DW$103, DW_AT_decl_column(0x11)
    1527                    
    1528                    $C$DW$104       .dwtag  DW_TAG_member
    1529                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$25)
    1530                            .dwattr $C$DW$104, DW_AT_name("REF_2P5V")
    1531                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("REF_2P5V")
    1532                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    1533                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1534                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1535                            .dwattr $C$DW$104, DW_AT_decl_line(0x505)
    1536                            .dwattr $C$DW$104, DW_AT_decl_column(0x11)
    1537                    
    1538                    $C$DW$105       .dwtag  DW_TAG_member
    1539                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$25)
    1540                            .dwattr $C$DW$105, DW_AT_name("FLASH_INFO_TAG")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   29

    1541                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("FLASH_INFO_TAG")
    1542                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    1543                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1544                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1545                            .dwattr $C$DW$105, DW_AT_decl_line(0x506)
    1546                            .dwattr $C$DW$105, DW_AT_decl_column(0x11)
    1547                    
    1548                    $C$DW$106       .dwtag  DW_TAG_member
    1549                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$25)
    1550                            .dwattr $C$DW$106, DW_AT_name("FLASH_INFO_LEN")
    1551                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("FLASH_INFO_LEN")
    1552                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    1553                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1554                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1555                            .dwattr $C$DW$106, DW_AT_decl_line(0x507)
    1556                            .dwattr $C$DW$106, DW_AT_decl_column(0x11)
    1557                    
    1558                    $C$DW$107       .dwtag  DW_TAG_member
    1559                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$25)
    1560                            .dwattr $C$DW$107, DW_AT_name("FLASH_MAX_PROG_PULSES")
    1561                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("FLASH_MAX_PROG_PULSES")
    1562                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1563                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1564                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1565                            .dwattr $C$DW$107, DW_AT_decl_line(0x508)
    1566                            .dwattr $C$DW$107, DW_AT_decl_column(0x11)
    1567                    
    1568                    $C$DW$108       .dwtag  DW_TAG_member
    1569                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$25)
    1570                            .dwattr $C$DW$108, DW_AT_name("FLASH_MAX_ERASE_PULSES")
    1571                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("FLASH_MAX_ERASE_PULSES")
    1572                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1573                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1574                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1575                            .dwattr $C$DW$108, DW_AT_decl_line(0x509)
    1576                            .dwattr $C$DW$108, DW_AT_decl_column(0x11)
    1577                    
    1578                    $C$DW$109       .dwtag  DW_TAG_member
    1579                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$25)
    1580                            .dwattr $C$DW$109, DW_AT_name("RANDOM_NUM_TAG")
    1581                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("RANDOM_NUM_TAG")
    1582                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    1583                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1584                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1585                            .dwattr $C$DW$109, DW_AT_decl_line(0x50a)
    1586                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    1587                    
    1588                    $C$DW$110       .dwtag  DW_TAG_member
    1589                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$25)
    1590                            .dwattr $C$DW$110, DW_AT_name("RANDOM_NUM_LEN")
    1591                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("RANDOM_NUM_LEN")
    1592                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    1593                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1594                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1595                            .dwattr $C$DW$110, DW_AT_decl_line(0x50b)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   30

    1596                            .dwattr $C$DW$110, DW_AT_decl_column(0x11)
    1597                    
    1598                    $C$DW$111       .dwtag  DW_TAG_member
    1599                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$25)
    1600                            .dwattr $C$DW$111, DW_AT_name("RANDOM_NUM_1")
    1601                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("RANDOM_NUM_1")
    1602                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1603                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1604                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1605                            .dwattr $C$DW$111, DW_AT_decl_line(0x50c)
    1606                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1607                    
    1608                    $C$DW$112       .dwtag  DW_TAG_member
    1609                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$25)
    1610                            .dwattr $C$DW$112, DW_AT_name("RANDOM_NUM_2")
    1611                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("RANDOM_NUM_2")
    1612                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    1613                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1614                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1615                            .dwattr $C$DW$112, DW_AT_decl_line(0x50d)
    1616                            .dwattr $C$DW$112, DW_AT_decl_column(0x11)
    1617                    
    1618                    $C$DW$113       .dwtag  DW_TAG_member
    1619                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$25)
    1620                            .dwattr $C$DW$113, DW_AT_name("RANDOM_NUM_3")
    1621                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("RANDOM_NUM_3")
    1622                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    1623                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1624                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1625                            .dwattr $C$DW$113, DW_AT_decl_line(0x50e)
    1626                            .dwattr $C$DW$113, DW_AT_decl_column(0x11)
    1627                    
    1628                    $C$DW$114       .dwtag  DW_TAG_member
    1629                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$25)
    1630                            .dwattr $C$DW$114, DW_AT_name("RANDOM_NUM_4")
    1631                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("RANDOM_NUM_4")
    1632                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    1633                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1634                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1635                            .dwattr $C$DW$114, DW_AT_decl_line(0x50f)
    1636                            .dwattr $C$DW$114, DW_AT_decl_column(0x11)
    1637                    
    1638                    $C$DW$115       .dwtag  DW_TAG_member
    1639                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$25)
    1640                            .dwattr $C$DW$115, DW_AT_name("BSL_CFG_TAG")
    1641                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("BSL_CFG_TAG")
    1642                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    1643                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1644                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1645                            .dwattr $C$DW$115, DW_AT_decl_line(0x510)
    1646                            .dwattr $C$DW$115, DW_AT_decl_column(0x11)
    1647                    
    1648                    $C$DW$116       .dwtag  DW_TAG_member
    1649                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$25)
    1650                            .dwattr $C$DW$116, DW_AT_name("BSL_CFG_LEN")
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   31

    1651                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("BSL_CFG_LEN")
    1652                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    1653                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1654                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1655                            .dwattr $C$DW$116, DW_AT_decl_line(0x511)
    1656                            .dwattr $C$DW$116, DW_AT_decl_column(0x11)
    1657                    
    1658                    $C$DW$117       .dwtag  DW_TAG_member
    1659                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$25)
    1660                            .dwattr $C$DW$117, DW_AT_name("BSL_PERIPHIF_SEL")
    1661                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("BSL_PERIPHIF_SEL")
    1662                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    1663                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1664                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1665                            .dwattr $C$DW$117, DW_AT_decl_line(0x512)
    1666                            .dwattr $C$DW$117, DW_AT_decl_column(0x11)
    1667                    
    1668                    $C$DW$118       .dwtag  DW_TAG_member
    1669                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$25)
    1670                            .dwattr $C$DW$118, DW_AT_name("BSL_PORTIF_CFG_UART")
    1671                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_UART")
    1672                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    1673                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1674                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1675                            .dwattr $C$DW$118, DW_AT_decl_line(0x513)
    1676                            .dwattr $C$DW$118, DW_AT_decl_column(0x11)
    1677                    
    1678                    $C$DW$119       .dwtag  DW_TAG_member
    1679                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$25)
    1680                            .dwattr $C$DW$119, DW_AT_name("BSL_PORTIF_CFG_SPI")
    1681                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_SPI")
    1682                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    1683                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1684                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1685                            .dwattr $C$DW$119, DW_AT_decl_line(0x514)
    1686                            .dwattr $C$DW$119, DW_AT_decl_column(0x11)
    1687                    
    1688                    $C$DW$120       .dwtag  DW_TAG_member
    1689                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$25)
    1690                            .dwattr $C$DW$120, DW_AT_name("BSL_PORTIF_CFG_I2C")
    1691                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_I2C")
    1692                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    1693                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1694                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1695                            .dwattr $C$DW$120, DW_AT_decl_line(0x515)
    1696                            .dwattr $C$DW$120, DW_AT_decl_column(0x11)
    1697                    
    1698                    $C$DW$121       .dwtag  DW_TAG_member
    1699                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$25)
    1700                            .dwattr $C$DW$121, DW_AT_name("TLV_END")
    1701                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("TLV_END")
    1702                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    1703                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1704                            .dwattr $C$DW$121, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devices
    1705                            .dwattr $C$DW$121, DW_AT_decl_line(0x516)
TI ARM Assembler PC v20.2.0 Sat Apr 17 13:50:07 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{F024A027-6025-4234-A3A3-A8D670C333AE} PAGE   32

    1706                            .dwattr $C$DW$121, DW_AT_decl_column(0x11)
    1707                    
    1708                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\device
    1709                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x4c3)
    1710                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1711                            .dwendtag $C$DW$T$28
    1712                    
    1713                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1714                            .dwattr $C$DW$T$186, DW_AT_name("TLV_Type")
    1715                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$28)
    1716                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1717                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:\ti\simplelink_msp432p4_sdk_3_40_01_02\source\ti\devic
    1718                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x517)
    1719                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1720                    
    1721                    
    1722                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1723                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x8c)
    1724                    $C$DW$122       .dwtag  DW_TAG_member
    1725                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$25)
    1726                            .dwattr $C$DW$122, DW_AT_name("CPUID")
    1727                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("CPUID")
    1728                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1730                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    1731                            .dwattr $C$DW$122, DW_AT_decl_line(0x1ba)
    1732                            .dwattr $C$DW$122, DW_AT_decl_column(0x12)
    1733                    
    1734                    $C$DW$123       .dwtag  DW_TAG_member
    1735                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$23)
    1736                            .dwattr $C$DW$123, DW_AT_name("ICSR")
    1737                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("ICSR")
